_posts/2016-06-16-linux系统启动流程.html
---
title: "Linux系统启动流程"
date: 2016-06-16
layout: post
categories: 
- Linux
tags: 
- Linux 
- 运维 
- 系统
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. POST: 加电自检</a></li>
<li><a href="#orgheadline9">2. Boot Sequence</a>
<ul>
<li><a href="#orgheadline2">bootloader</a></li>
<li><a href="#orgheadline8">grub legacy</a>
<ul>
<li><a href="#orgheadline3">grub的启动阶段</a></li>
<li><a href="#orgheadline4">grub命令行</a></li>
<li><a href="#orgheadline5">配置文件</a></li>
<li><a href="#orgheadline6">进入单用户模式</a></li>
<li><a href="#orgheadline7">安装grub</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline18">3. kernel</a>
<ul>
<li><a href="#orgheadline10">系统初始化</a></li>
<li><a href="#orgheadline17">init(CentOS 6)</a>
<ul>
<li><a href="#orgheadline11">运行级别</a></li>
<li><a href="#orgheadline12">配置文件</a></li>
<li><a href="#orgheadline13">/etc/rc.d/rc.sysinit</a></li>
<li><a href="#orgheadline14">服务</a></li>
<li><a href="#orgheadline15">chkconfig</a></li>
<li><a href="#orgheadline16">xinetd</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
描述了Linux系统的启动过程，以及各种相关程序的使用，例如grub的配置与命令、init的作用与控制、systemd的使用等
</p>




<hr  />
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> POST: 加电自检</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>加载CPU, 设定ROM中的固定地址</li>
<li>通过ROM(CMOS)内的程序进行自检</li>
<li>加载BIOS: Basic Input and Output System</li>
<li>整个计算机的地址空间是ROM+RAM组成的</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">2</span> Boot Sequence</h2>
<div class="outline-text-2" id="text-2">
<p>
按次序查找各引导设备，第一个有引导程序的设备即为本次启动用到设备
</p>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">bootloader</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li>bootloader: 引导加载器
<ul class="org-ul">
<li>windows: ntloader</li>
<li>Linux: LILO, GRUB, GRUB2</li>
<li>功能: 提供一个菜单，允许用户选择要启动系统或不同的内核版本；把用户选定的内核装载到内存中的特定空间中，解压、展开，并把系统控制权移交给内核</li>
</ul></li>
<li>MBR:
<ul class="org-ul">
<li>前446字节: bootloader</li>
<li>64字节: 硬盘分区表(fat)</li>
<li>2: 55AA</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">grub legacy</h3>
<div class="outline-text-3" id="text-orgheadline8">
</div><div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3">grub的启动阶段</h4>
<div class="outline-text-4" id="text-orgheadline3">
<ul class="org-ul">
<li>stage1: mbr</li>
<li>stage1_5: mbr之后的扇区，让stage1中的bootloader能识别stage2所在的分区上的文件系统</li>
<li>stage2：读取磁盘分区(/boot/grub)上的程序
<ol class="org-ol">
<li>提供菜单、并提供交互式接口
<ul class="org-ul">
<li>e: 编辑模式，用于编辑菜单；</li>
<li>c: 命令模式，交互式接口；</li>
</ul></li>
<li>加载用户选择的内核或操作系统
<ul class="org-ul">
<li>允许传递参数给内核</li>
<li>可隐藏此菜单</li>
</ul></li>
<li>为菜单提供了保护机制
<ul class="org-ul">
<li>为编辑菜单进行认证</li>
<li>为启用内核或操作系统进行认证</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">grub命令行</h4>
<div class="outline-text-4" id="text-orgheadline4">
<ul class="org-ul">
<li>设备名(hd#, #)
<ul class="org-ul">
<li>hd#: 磁盘编号，从0开始编号</li>
<li>#: 分区编号，从0开始编号</li>
<li>只能识别基本分区</li>
</ul></li>
<li>常用命令
<ul class="org-ul">
<li>help: 获取命令帮助</li>
<li>help KEYWORD: 详细帮助信息</li>
<li>find (hd#,#)/PATH/TO/SOMEFILE：查询文件存在性</li>
<li>root (hd#,#): 设定根设备</li>
<li>kernel /PATH/TO/KERNEL_FILE [OPTIONS]: 设定本次启动时用到的内核文件，额外还可以添加许多内核支持使用的cmdline参数
<ul class="org-ul">
<li>例如: <code>kernel /vmlinuz-VERSION-RELEASE ro root=/dev/DEVICE</code></li>
<li>init=/path/to/init: 该参数能设定开机运行的第一个程序</li>
</ul></li>
<li>initrd /PATH/TO/INITRAMFS_FILE: 设定为选定的内核提供额外文件的ramdisk</li>
<li>boot: 引导启动选定的内核</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">配置文件</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
grub配置文件是 <code>/boot/grub/grub.conf</code> ，而 <code>/etc/grub.conf</code> 是指向该文件的链接
</p>
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #FD971F;">default</span>=NUM  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#23450;&#40664;&#35748;&#21551;&#21160;&#30340;&#33756;&#21333;&#39033;&#65292;&#33756;&#21333;&#39033;(title)&#32534;&#21495;&#20174;0&#24320;&#22987;</span>
<span style="color: #FD971F;">timeout</span>=NUM  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25351;&#23450;&#33756;&#21333;&#39033;&#31561;&#24453;&#36873;&#39033;&#36873;&#25321;&#30340;&#26102;&#38271;</span>
<span style="color: #FD971F;">splashimage</span>=(hd*,*)/PATH/TO/XPM_PIC_FILE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25351;&#26126;&#33756;&#21333;&#32972;&#26223;&#22270;&#29255;&#25991;&#20214;&#36335;&#24452;</span>
hiddenmenu  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#38544;&#34255;&#33756;&#21333;</span>
password [--md5] STRING  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33756;&#21333;&#32534;&#36753;&#35748;&#35777;&#65292;&#33756;&#21333;&#19979;&#29992;p&#26469;&#36755;&#20837;&#23494;&#30721;&#35299;&#38145;</span>
title TITLE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;&#33756;&#21333;&#39033;&#8220;&#26631;&#39064;&#8221;, &#21487;&#20986;&#29616;&#22810;&#27425;</span>
    root (hd*,*)  <span style="color: #75715E;"># </span><span style="color: #75715E;">grub&#26597;&#25214;stage2&#21450;kernel&#25991;&#20214;&#25152;&#22312;&#35774;&#22791;&#20998;&#21306;</span>
    kernel /PATH/TO/VMLINUZ_FILE [PARAMETERS]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#30340;&#20869;&#26680;</span>
    initrd /PATH/TO/INITRAMFS_FILE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20869;&#26680;&#21305;&#37197;&#30340;ramfs&#25991;&#20214;</span>
    password [--md5] STRING  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#36873;&#23450;&#30340;&#20869;&#26680;&#25110;&#25805;&#20316;&#31995;&#32479;&#26102;&#36827;&#34892;&#35748;&#35777;</span>
</pre>
</div>

<ul class="org-ul">
<li>生成GRUB加密密码的工具: <code>grub-md5-crypt</code></li>
<li>若配置文件出错，则会直接进入命令行操作</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">进入单用户模式</h4>
<div class="outline-text-4" id="text-orgheadline6">
<ol class="org-ol">
<li>编辑grub菜单(选定要编辑的title，而后使用e命令)</li>
<li>在选定的kernel后附加 1, s, S或single都可以</li>
<li>在kernel所在行，键入b命令</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">安装grub</h4>
<div class="outline-text-4" id="text-orgheadline7">
<ul class="org-ul">
<li><p>
grub-install
</p>
<div class="org-src-container">

<pre class="src src-sh">grub-install --root-directory=ROOT /dev/DISK
<span style="color: #75715E;"># </span><span style="color: #75715E;">ROOT&#26159;boot&#25346;&#36733;&#30340;&#30446;&#24405;</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#24314;&#31435;&#21518;grub.conf&#38656;&#35201;&#33258;&#24049;&#21019;&#24314;</span>
</pre>
</div></li>
<li><p>
grub命令行
</p>
<div class="org-src-container">

<pre class="src src-sh">grub&gt; root <span style="color: #AE81FF;">(</span>hd*,*<span style="color: #AE81FF;">)</span>
grub&gt; setup <span style="color: #AE81FF;">(</span>hd*<span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li>可以通过光盘的紧急救援模式来修复grub</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">3</span> kernel</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">系统初始化</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li>探测可识别到的所有硬件设备</li>
<li>加载硬件驱动程序（有可能会借助于ramdisk加载驱动）
<ul class="org-ul">
<li>ramdisk: ramfs文件系统(防止进行缓存)
<ul class="org-ul">
<li>initrd(CentOS 5), 用mkinitrd生成</li>
<li>initramfs(CentOS 6), 用dracut生成</li>
</ul></li>
</ul></li>
<li>以只读方式挂载根文件系统(rootfs)</li>
<li>运行用户空间的第一个应用程序
<ul class="org-ul">
<li>SysV: init(CentOS 5)
<ul class="org-ul">
<li>配置文件: /etc/inittab</li>
</ul></li>
<li>Upstart: init(CentOS 6)
<ul class="org-ul">
<li>配置文件: /etc/inittab, /etc/init/*.conf</li>
</ul></li>
<li>Systemd: systemd(CentOS 7)
<ul class="org-ul">
<li>配置文件: /usr/lib/systemd/system, /etc/systemd/system</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">init(CentOS 6)</h3>
<div class="outline-text-3" id="text-orgheadline17">
</div><div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">运行级别</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
为了系统的运行或维护等应用目的而设定
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">关机</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">单用户single模式(root, 无须登录), single, 维护模式</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">多用户模式，会启动网络功能，但不会启动NFS</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">多用户模式，正常模式；文本界面</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">预留级别；可同3级别</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">多用户模式，正常模式；图形界面</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">重启</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>默认级别: 3, 5</li>
</ul>
<div class="org-src-container">

<pre class="src src-conf">init NUM  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20999;&#25442;&#24403;&#21069;&#32423;&#21035;</span>
runlevel  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#30475;&#19978;&#19968;&#20010;&#32423;&#21035;&#21644;&#24403;&#21069;&#32423;&#21035;</span>
who -r  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#30475;&#24403;&#21069;&#32423;&#21035;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">配置文件</h4>
<div class="outline-text-4" id="text-orgheadline12">
<p>
在配置文件 <code>/etc/inittab</code> 中，每一行定义一种action以及对应的process
</p>
<ul class="org-ul">
<li><p>
配置文件的内容:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #AE81FF;">id</span>:<span style="color: #AE81FF;">runlevel</span>:<span style="color: #AE81FF;">action</span>:<span style="color: #66D9EF;">process</span>
  <span style="color: #FD971F;">action</span>:
    wait: &#20999;&#25442;&#33267;&#27492;&#32423;&#21035;&#36816;&#34892;&#19968;&#27425;
    respawn&#65306;&#27492;process&#32456;&#27490;&#65292;&#23601;&#37325;&#26032;&#21551;&#21160;&#20043;

id:<span style="color: #AE81FF;">3</span>:initdefault:  # &#35774;&#32622;&#40664;&#35748;&#32423;&#21035;
si::sysinit:/etc/rc.d/rc.sysinit  # &#35774;&#23450;&#31995;&#32479;&#21021;&#22987;&#21270;&#26041;&#24335;

l0:<span style="color: #AE81FF;">0</span>:wait:/etc/rc.d/rc <span style="color: #AE81FF;">0</span>  # &#35835;&#21462;/etc/rc.d/rc0.d/
l1:<span style="color: #AE81FF;">1</span>:wait:/etc/rc.d/rc <span style="color: #AE81FF;">1</span>  # &#35835;&#21462;/etc/rc.d/rc1.d/
...
l6:<span style="color: #AE81FF;">6</span>:wait:/etc/rc.d/rc <span style="color: #AE81FF;">6</span>  # &#35835;&#21462;/etc/rc.d/rc6.d/

tty1:<span style="color: #AE81FF;">2345</span>:respawn:/usr/sbin/mingetty tty1  # &#21551;&#21160;tty&#32456;&#31471;
tty2:<span style="color: #AE81FF;">2345</span>:respawn:/usr/sbin/mingetty tty2  # mingetty&#20250;&#35843;&#29992;login&#31243;&#24207;
...
tty6:<span style="color: #AE81FF;">2345</span>:respawn:/usr/sbin/mingetty tty6
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13">/etc/rc.d/rc.sysinit</h4>
<div class="outline-text-4" id="text-orgheadline13">
<p>
系统初始化脚本
</p>
<ol class="org-ol">
<li>设置主机名</li>
<li>设置欢迎信息</li>
<li>激活udev和selinux</li>
<li>挂载/etc/fstab文件中定义的文件系统</li>
<li>检测根文件系统，并以读写方式重新挂载根文件系统</li>
<li>读取硬件时钟设置系统时钟</li>
<li>激活swap设备</li>
<li>根据/etc/sysctl.conf文件设置内核参数</li>
<li>激活lvm及software raid设备</li>
<li>加载额外设备的驱动程序</li>
<li>清理操作</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14">服务</h4>
<div class="outline-text-4" id="text-orgheadline14">
<ul class="org-ul">
<li><p>
<i>etc/rc.d/rc{0-6}.d</i>
</p>
<ul class="org-ul">
<li>K##*: 数字越小，越先被stop；数字越小的服务，通常为依赖到别的服务</li>
<li>S##*: 数字越小，越先被start；数字越小的服务，通常为被依赖到的服务</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">/etc/rc.d/rc&#30340;&#37096;&#20998;&#25191;&#34892;&#20869;&#23481;</span>
  <span style="color: #F92672;">for</span> srv<span style="color: #F92672;"> in</span> /etc/rc.d/rc$<span style="color: #AE81FF;">{</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">}</span>.d/K*; <span style="color: #F92672;">do</span>
      $<span style="color: #FD971F;">srv</span> stop
  <span style="color: #F92672;">done</span>

  <span style="color: #F92672;">for</span> srv<span style="color: #F92672;"> in</span> /etc/rc.d/rc$<span style="color: #AE81FF;">{</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">}</span>.d/S*; <span style="color: #F92672;">do</span>
      $<span style="color: #FD971F;">srv</span> start
  <span style="color: #F92672;">done</span>
</pre>
</div></li>

<li>正常级别下，最后启动一个服务S99local指向了/etc/rc.d/rc.local脚本；因此，不便或不需写为服务脚本且又想开机时自动运行的命令，可直接放置于/etc/rc.d/rc.local文件中</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15">chkconfig</h4>
<div class="outline-text-4" id="text-orgheadline15">
<p>
服务管理工具
</p>
<dl class="org-dl">
<dt>查询</dt><dd><ul class="org-ul">
<li>查看服务在所有级别的启动关闭情况</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">chkconfig --list <span style="color: #AE81FF;">[</span>NAME<span style="color: #AE81FF;">]</span>  
  NAME: &#26597;&#30475;&#25351;&#23450;&#26381;&#21153;&#30340;&#29366;&#24577;
</pre>
</div></dd>
<dt>添加</dt><dd><ul class="org-ul">
<li>将SysV的服务脚本放置于/etc/rc.d/init.d或/etc/init.d中</li>
<li>服务的启动关闭设置取决于脚本中的chkconfig设置</li>
</ul>
<div class="org-src-container">

<pre class="src src-conf">chkconfig --add NAME 
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#33050;&#26412;&#20013;&#30340;chkconfig&#35774;&#32622;</span>
chkconfig: NNN aa bb
  NNN: &#25351;&#23450;&#22312;&#21738;&#20010;&#32423;&#21035;&#19979;&#26159;S&#29366;&#24577;&#65292;&#27809;&#25351;&#23450;&#30340;&#20026;K&#29366;&#24577;
  aa: S&#29366;&#24577;&#19979;&#30340;&#25968;&#23383;
  bb: K&#29366;&#24577;&#19979;&#30340;&#25968;&#23383;
</pre>
</div></dd>
<dt>修改</dt><dd><ul class="org-ul">
<li>修改制定的连接类型</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">chkconfig <span style="color: #AE81FF;">[</span>--level levels<span style="color: #AE81FF;">]</span> name &lt;on|off|reset&gt;
  --level NNN: &#25351;&#23450;&#35201;&#35774;&#32622;&#30340;&#32423;&#21035;<span style="color: #AE81FF;">(</span>&#40664;&#35748;&#20026;2345<span style="color: #AE81FF;">)</span>
</pre>
</div></dd>
<dt>删除</dt><dd><div class="org-src-container">

<pre class="src src-conf">chkconfig --del NAME
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16">xinetd</h4>
<div class="outline-text-4" id="text-orgheadline16">
<p>
xinetd是一个超级守护进程，代替服务监听端口，一旦有请求就启动服务进行处理
</p>
</div>
</div>
</div>
</div>
